{

  "presentation": [{
    "id": 3989,
    "createdDate": 1415554471743,
    "updatedDate": null,
    "version": 0,
    "audioLink": null,
    "description": "Maybe you have heard the name \"functional programming\" and you're interested to learn _what_ it is.  Well there is no better way to learn a new paradigm than by actually seeing it implemented.  In this workshop we'll take a working code example and transform it into the functional paradigm all in Java 7.  We'll step through everything from higher-order functions, function purity and even to some levels of immutability.  At the end, we'll show how we can make use of Java 8's lambdas by very simple changes to the code that we've already refactored.\r\nAt the end, you should be able to take the concepts that you learn from this workshop and start using them the next day at work!",
    "presentationLink": null,
    "speakers": [{
      "id": 3987,
      "createdDate": 1415554471683,
      "updatedDate": 1419199113830,
      "version": 2,
      "bio": "Senior Software Developer at Dell who writes and maintains multiple applications in a variety of languages such as C/C++, Java, Scala, and Groovy. Consistently pushes the boundaries of the development organizations “norm.” Enjoys testing and learning new languages and frameworks in the off time. ",
      "firstName": "Josh",
      "lastName": "Backfield",
      "twitterId": "@jbackfield",
      "googlePlusId": "",
      "linkedInId": "jbackfield",
      "lanyrdId": "",
      "githubId": "jbackfield"
    }],
    "title": "Functional Design By Example",
    "presentationType": "WORKSHOP",
    "skillLevel": "BEGINNER",
    "track": {
      "id": 30,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Workshop (Full Day)",
      "cssStyleName": null,
      "color": "#6c6f70",
      "description": null,
      "trackOrder": 1
    },
    "presentationTags": [{
      "id": 3988,
      "createdDate": 1415554471735,
      "updatedDate": null,
      "version": 0,
      "name": "paradigm"
    }, {
      "id": 2240,
      "createdDate": 1389120418415,
      "updatedDate": null,
      "version": 0,
      "name": "java"
    }]
  }, {
    "id": 3986,
    "createdDate": 1415554378791,
    "updatedDate": null,
    "version": 0,
    "audioLink": null,
    "description": "Whether your project is big data or enterprise integration, Spring XD makes it easy to solve common big data integration problems such as data ingestion and export, real-time analytics, and batch workflow orchestration.  In this workshop we will cover stream creation, batch job execution and high availability.  You will learn how to create streams to capture live data from various sources (hdfs,tcp, no sql, RDBMS), filter and modify the data as well as capture counts then output this data to various sinks (hdfs,tcp, no sql, RDBMS).  Also covered is how to create batch workflow solutions that span traditional use-cases such as moving data between flat files and relational databases as well as Hadoop use-cases.\r\nThe best news is that you don't need to code anything up to get going, no build scripts, no IDE, no maven coordinates.  If you are working on a big data, Spring Integration, Spring Batch project this workshop is for you.  This is a hands-on workshop so bring your laptop!",
    "presentationLink": null,
    "speakers": [{
      "id": 1432,
      "createdDate": null,
      "updatedDate": 1415554378556,
      "version": 3,
      "bio": "As a Pivotal engineer, Glenn is a core committer for Spring XD,  Spring Integration and has contributed to Spring Batch and Spring Boot. He has 12 years experience in designing, building and delivering enterprise level applications in Java and 20 years total of software development experience.",
      "firstName": "Glenn",
      "lastName": "Renfro",
      "twitterId": "cppwfs",
      "googlePlusId": "118403724743837766935",
      "linkedInId": "https://www.linkedin.com/in/cppwfs",
      "lanyrdId": "glenn-renfro",
      "githubId": "cppwfs"
    }],
    "title": "Spring XD: Big Data Integration's perfect solution is at your service.",
    "presentationType": "WORKSHOP",
    "skillLevel": "INTERMEDIATE",
    "track": {
      "id": 30,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Workshop (Full Day)",
      "cssStyleName": null,
      "color": "#6c6f70",
      "description": null,
      "trackOrder": 1
    },
    "presentationTags": [{
      "id": 2298,
      "createdDate": 1389137813688,
      "updatedDate": null,
      "version": 0,
      "name": "big data"
    }, {
      "id": 2354,
      "createdDate": 1389219745417,
      "updatedDate": null,
      "version": 0,
      "name": "spring batch"
    }, {
      "id": 2316,
      "createdDate": 1389154849649,
      "updatedDate": null,
      "version": 0,
      "name": "spring"
    }, {
      "id": 3985,
      "createdDate": 1415554378716,
      "updatedDate": null,
      "version": 0,
      "name": "enterprise integration patterns"
    }, {
      "id": 2318,
      "createdDate": 1389154849650,
      "updatedDate": null,
      "version": 0,
      "name": "spring integration"
    }, {
      "id": 2240,
      "createdDate": 1389120418415,
      "updatedDate": null,
      "version": 0,
      "name": "java"
    }]
  }, {
    "id": 4640,
    "createdDate": 1419349578146,
    "updatedDate": null,
    "version": 0,
    "audioLink": "",
    "description": "A full day hands on workshop that teaches some of the Scala basics to get you started, then moves on to the Play Framework a web framework that can either use Java or Scala to do anything web (we will be doing Scala). Then we move on to actors and reactive programming using Akka. Bring your thinking caps on because this won't be for the faint of heart, but it will be fun.",
    "presentationLink": "",
    "speakers": [{
      "id": 1331,
      "createdDate": null,
      "updatedDate": 1418596125825,
      "version": 3,
      "bio": "Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.",
      "firstName": "Daniel",
      "lastName": "Hinojosa",
      "twitterId": "dhinojosa",
      "googlePlusId": "",
      "linkedInId": "",
      "lanyrdId": "",
      "githubId": ""
    }],
    "title": "Scala & Play & Akka",
    "presentationType": "WORKSHOP",
    "skillLevel": "BEGINNER",
    "track": {
      "id": 30,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Workshop (Full Day)",
      "cssStyleName": null,
      "color": "#6c6f70",
      "description": null,
      "trackOrder": 1
    },
    "presentationTags": [{
      "id": 2414,
      "createdDate": 1389374087728,
      "updatedDate": null,
      "version": 0,
      "name": "scala"
    }, {
      "id": 2416,
      "createdDate": 1389374360747,
      "updatedDate": null,
      "version": 0,
      "name": "akka"
    }, {
      "id": 2419,
      "createdDate": 1389374360750,
      "updatedDate": null,
      "version": 0,
      "name": "web"
    }, {
      "id": 2418,
      "createdDate": 1389374360749,
      "updatedDate": null,
      "version": 0,
      "name": "reactive programming"
    }, {
      "id": 2417,
      "createdDate": 1389374360749,
      "updatedDate": null,
      "version": 0,
      "name": "play"
    }]
  }, {
    "id": 3990,
    "createdDate": 1415554718304,
    "updatedDate": null,
    "version": 0,
    "audioLink": null,
    "description": "Learn Android development from the ground up. We'll start with the SDK and the Android Studio IDE and build, test, and deploy applications on both emulators and (if available) physical devices. Several examples will be provided that cover a range of topics from basic activities to the SQLite database to accessing RESTful web services.",
    "presentationLink": null,
    "speakers": [{
      "id": 1323,
      "createdDate": null,
      "updatedDate": 1420264607612,
      "version": 5,
      "bio": "Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.",
      "firstName": "Ken",
      "lastName": "Kousen",
      "twitterId": "kenkousen",
      "googlePlusId": "+KennethKousen",
      "linkedInId": "kenkousen",
      "lanyrdId": "",
      "githubId": "kousen"
    }],
    "title": "Android Workshop",
    "presentationType": "WORKSHOP",
    "skillLevel": "BEGINNER",
    "track": {
      "id": 30,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Workshop (Full Day)",
      "cssStyleName": null,
      "color": "#6c6f70",
      "description": null,
      "trackOrder": 1
    },
    "presentationTags": [{
      "id": 2283,
      "createdDate": 1389122783782,
      "updatedDate": null,
      "version": 0,
      "name": "mobile"
    }]
  }, {
    "id": 3992,
    "createdDate": 1415554879023,
    "updatedDate": null,
    "version": 0,
    "audioLink": null,
    "description": "\r\nComponent-oriented UI development has been popular for over twenty years, with the introduction of Visual Basic. The promise is simple: packaged reusable code that makes powerful widgets like grids, toolbars, menus, smart input controls, panels, media players, charts, graphs, trees, image viewers, and so on, easy to integrate into applications.\r\n\r\nOn the web, frameworks such as ASP.NET, JSF, Tapestry, Wicket, GWT, and Vaadin take advantage of component architectures, and there is no shortage of JavaScript/HTML5 widget libraries such as YUI, KendoUI, jQuery UI, Bootstrap, ExtJS, and so on. Each of these frameworks allows developers to build their own custom components, but those components won’t work outside of the framework. Wouldn’t it be nice if there were a standard way to build a UI component that runs in a browser? A component model that is part of the open web?\r\n\r\nFinally, there is: Web Components, an emerging standard from the Web Applications Working Group (WAWG). Web Components consists of five different standards: Templates, Decorators,\r\nCustom Elements, Shadow DOM, and Imports. Together, these standards allow you to build custom widgets with HTML5, JavaScript, and CSS that can be used just like native HTML elements.\r\n\r\nSince the standards are not fully supported in all browsers, you need a library to support them in non-compliant browsers. Google’s Polymer does just this, and more.\r\n\r\nCome to this workshop to learn about these exciting new technologies hands-on.",
    "presentationLink": null,
    "speakers": [{
      "id": 3991,
      "createdDate": 1415554878993,
      "updatedDate": 1420264373146,
      "version": 5,
      "bio": "Kito D. Mann is the Principal Consultant at Virtua, Inc., specializing in enterprise application architecture, training, development, and mentoring with JavaServer Faces, portlets, Liferay, and Java EE technologies. He is also the editor-in-chief of JSFCentral.com (www.jsfcentral.com), co-host of the [Enterprise Java Newscast](http://www.enterprisejavanews.com), host of the [JSF Podcast interview series] (http://www.jsfcentral.com/resources/jsfcentralpodcasts/), and the author of JavaServer Faces in Action (Manning). Mann has participated in several Java Community Process expert groups (including CDI, JSF and Portlets) and is also an internationally recognized speaker. He holds a BA in Computer Science from Johns Hopkins University.",
      "firstName": "Kito",
      "lastName": "Mann",
      "twitterId": "kito99",
      "googlePlusId": "",
      "linkedInId": "kitomann",
      "lanyrdId": "",
      "githubId": "kito99"
    }],
    "title": "Hacking Web Components and Polymer",
    "presentationType": "WORKSHOP",
    "skillLevel": "BEGINNER",
    "track": {
      "id": 30,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Workshop (Full Day)",
      "cssStyleName": null,
      "color": "#6c6f70",
      "description": null,
      "trackOrder": 1
    },
    "presentationTags": [{
      "id": 2290,
      "createdDate": 1389123197528,
      "updatedDate": null,
      "version": 0,
      "name": "html5"
    }]
  }, {
    "id": 3994,
    "createdDate": 1415555029184,
    "updatedDate": null,
    "version": 0,
    "audioLink": null,
    "description": "This is a hands-on workshop/extended lab to introduce the Java EE 7 platform.\r\n\r\nThe main theme of Java EE 7 is boosting productivity and embracing HTML 5. The changes include APIs like JAX-RS 2, JMS 2, Java Batch, Java EE Concurrency, WebSocket, JSON-P and JSF 2.2. The workshop will introduce these changes in a step-by-step fashion using a realistic end-to-end application deployed on GlassFish 4 using NetBeans.\r\n\r\nAlthough the primary focus will be on the new APIs and features, we will take a holistic approach to the workshop and also cover the features introduced in Java EE 5 and Java EE 6 such as the ones in EJB 3, CDI, JPA, Bean Validation and JSF focused on annotations, intelligent defaults, type-safe, powerful, fluent APIs.\r\n\r\nAt the end of the workshop, you will have a broad introduction to Java EE 7 and will be ready to write your own applications having already written quite a bit of code in the workshop.",
    "presentationLink": null,
    "speakers": [{
      "id": 1390,
      "createdDate": null,
      "updatedDate": 1421180670416,
      "version": 8,
      "bio": "Reza Rahman is a long time former independent consultant and now officially a Java EE/GlassFish evangelist at Oracle. He is the author of the popular book EJB 3 in Action. Reza is a frequent speaker at Java User Groups and conferences worldwide including JavaOne and NFJS. He is an avid contributor to industry journals like JavaLobby/DZone and TheServerSide. Reza has been a member of the Java EE, EJB and JMS expert groups. He implemented the EJB container for the Resin open source Java EE application server.\r\n\r\nReza has over a decade of experience with technology leadership, enterprise architecture, application development and consulting. He has been working with Java EE technology since its inception, developing on almost every major application platform ranging from Tomcat to JBoss, GlassFish, WebSphere and WebLogic. Reza has developed enterprise systems for well-known companies like eBay, Motorola, Comcast, Nokia, Prudential, Guardian Life, USAA, Independence Blue Cross and AAA using EJB 2, EJB 3, CDI, Spring and Seam.",
      "firstName": "Reza",
      "lastName": "Rahman",
      "twitterId": "reza_rahman",
      "googlePlusId": "",
      "linkedInId": "",
      "lanyrdId": "",
      "githubId": "m-reza-rahman"
    }],
    "title": "Down and Dirty with Java EE 7",
    "presentationType": "WORKSHOP",
    "skillLevel": "BEGINNER",
    "track": {
      "id": 30,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Workshop (Full Day)",
      "cssStyleName": null,
      "color": "#6c6f70",
      "description": null,
      "trackOrder": 1
    },
    "presentationTags": [{
      "id": 3993,
      "createdDate": 1415555029177,
      "updatedDate": null,
      "version": 0,
      "name": "java ee"
    }]
  }, {
    "id": 4881,
    "createdDate": 1422028698985,
    "updatedDate": 1422581951608,
    "version": 1,
    "audioLink": "",
    "description": "The Weather Company has gone through a transformation over the past 3 years taking us from a Cable TV focused company to a Big Data Technology leader. I will talk through the culture transformation that was required in order for us to achieve this rapid transformation and why having a Technology team that is playing off a prerecorded and tightly governed soundtrack isn't the answer and why being Live is how to best bring the \"Art of the Possible\" of technology thinking to life.",
    "presentationLink": "",
    "speakers": [{
      "id": 4880,
      "createdDate": 1422027838341,
      "updatedDate": 1422032017171,
      "version": 1,
      "bio": "Bryson is a firm believer in IT as a Service – the concept where IT “gets out of the way” and openly arms every product developer with the tools they need to crank out an endless supply of innovations.\r\n\r\nAs a member of the Executive Committee and self-proclaimed weather geek, Bryson plays a key role in the overall business strategy for The Weather Company and as head of the technology group, Bryson oversees the strategic vision, technical direction, development, execution and operations of all technology initiatives, systems and platforms across all of the company’s four divisions – TV, Digital, Professional and International.\r\n\r\nMr. Koehler brings a passion for change and innovation by sitting at the strategy table for both business and technology groups within large and small enterprises. He believes that a culture of \"Live vs. PreRecorded\" is the best way for an enterprise to embrace the capabilities of technology and empower their businesses to innovate and outperform.\r\n",
      "firstName": "Bryson",
      "lastName": "Koehler",
      "twitterId": "brysonkoehler",
      "googlePlusId": "",
      "linkedInId": "brysonkoehler",
      "lanyrdId": "",
      "githubId": ""
    }],
    "title": "Being \"Live!\" Real time technology decisioning ",
    "presentationType": "KEYNOTE",
    "skillLevel": "BEGINNER",
    "track": {
      "id": 32,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Keynotes",
      "cssStyleName": null,
      "color": "#edcd1c",
      "description": null,
      "trackOrder": 2
    },
    "presentationTags": []
  }, {
    "id": 4173,
    "createdDate": 1417211503392,
    "updatedDate": 1421420066746,
    "version": 2,
    "audioLink": "",
    "description": "As developers, we deal with management all the time but aren't normally interested in becoming managers ourselves. In fact, we take a perverse pride in being difficult to manage and being more interested in being right than doing what is politically expedient.\r\n\r\nUnsurprisingly, this leads to difficulties when business crises arise, like reorganizations, layoffs, or simply new opportunities that we would like to pursue. It's hard to get what you want when we're viewed as part of the problem rather than the solution.\r\n\r\nThis talk is about understanding the world of your manager and how you can take simple steps to build a relationship that you can rely on when you need it.",
    "presentationLink": "",
    "speakers": [{
      "id": 1323,
      "createdDate": null,
      "updatedDate": 1420264607612,
      "version": 5,
      "bio": "Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.",
      "firstName": "Ken",
      "lastName": "Kousen",
      "twitterId": "kenkousen",
      "googlePlusId": "+KennethKousen",
      "linkedInId": "kenkousen",
      "lanyrdId": "",
      "githubId": "kousen"
    }],
    "title": "Managing Your Manager",
    "presentationType": "KEYNOTE",
    "skillLevel": "BEGINNER",
    "track": {
      "id": 32,
      "createdDate": null,
      "updatedDate": null,
      "version": null,
      "name": "Keynotes",
      "cssStyleName": null,
      "color": "#edcd1c",
      "description": null,
      "trackOrder": 2
    },
    "presentationTags": [{
      "id": 4851,
      "createdDate": 1421420066642,
      "updatedDate": null,
      "version": 0,
      "name": "keynote"
    }, {
      "id": 4852,
      "createdDate": 1421420066744,
      "updatedDate": null,
      "version": 0,
      "name": "management"
    }]
  }]
}
